ARMmbed/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM302X/TARGET_ADUCM3029/device/sys/ADuCM302x.h
/* ============================================================================================================================
        RTC Register BitMasks, Positions & Enumerations 
   ============================================================================================================================ */
/* -------------------------------------------------------------------------------------------------------------------------
          RTC_CR0                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_CR0_WPNDINTEN               15            /*  Enable write pending sourced interrupts to the CPU */
#define BITP_RTC_CR0_WSYNCINTEN              14            /*  Enable write synchronization sourced interrupts to the CPU */
#define BITP_RTC_CR0_WPNDERRINTEN            13            /*  Enable write pending error sourced interrupts to the CPU when an RTC register-write pending error occurs */
#define BITP_RTC_CR0_ISOINTEN                12            /*  Enable RTC power-domain isolation sourced interrupts to the CPU when isolation of the RTC power domain is activated and subsequently de-activated */
#define BITP_RTC_CR0_MOD60ALMINTEN           11            /*  Enable periodic Modulo-60 RTC alarm sourced interrupts to the CPU */
#define BITP_RTC_CR0_MOD60ALM                 5            /*  Periodic, modulo-60 alarm time in prescaled RTC time units beyond a modulo-60 boundary */
#define BITP_RTC_CR0_MOD60ALMEN               4            /*  Enable RTC modulo-60 counting of time past a modulo-60 boundary */
#define BITP_RTC_CR0_TRMEN                    3            /*  Enable RTC digital trimming */
#define BITP_RTC_CR0_ALMINTEN                 2            /*  Enable sourced alarm interrupts to the CPU */
#define BITP_RTC_CR0_ALMEN                    1            /*  Enable the RTC alarm (absolute) operation */
#define BITP_RTC_CR0_CNTEN                    0            /*  Global enable for the RTC */

#define BITM_RTC_CR0_WPNDINTEN               (_ADI_MSK_3(0x00008000,0x00008000U, uint16_t  ))    /*  Enable write pending sourced interrupts to the CPU */

#define BITM_RTC_CR0_WSYNCINTEN              (_ADI_MSK_3(0x00004000,0x00004000U, uint16_t  ))    /*  Enable write synchronization sourced interrupts to the CPU */

#define BITM_RTC_CR0_WPNDERRINTEN            (_ADI_MSK_3(0x00002000,0x00002000U, uint16_t  ))    /*  Enable write pending error sourced interrupts to the CPU when an RTC register-write pending error occurs */

#define BITM_RTC_CR0_ISOINTEN                (_ADI_MSK_3(0x00001000,0x00001000U, uint16_t  ))    /*  Enable RTC power-domain isolation sourced interrupts to the CPU when isolation of the RTC power domain is activated and subsequently de-activated */

#define BITM_RTC_CR0_MOD60ALMINTEN           (_ADI_MSK_3(0x00000800,0x00000800U, uint16_t  ))    /*  Enable periodic Modulo-60 RTC alarm sourced interrupts to the CPU */

#define BITM_RTC_CR0_MOD60ALM                (_ADI_MSK_3(0x000007E0,0x000007E0U, uint16_t  ))    /*  Periodic, modulo-60 alarm time in prescaled RTC time units beyond a modulo-60 boundary */

#define BITM_RTC_CR0_MOD60ALMEN              (_ADI_MSK_3(0x00000010,0x00000010U, uint16_t  ))    /*  Enable RTC modulo-60 counting of time past a modulo-60 boundary */

#define BITM_RTC_CR0_TRMEN                   (_ADI_MSK_3(0x00000008,0x00000008U, uint16_t  ))    /*  Enable RTC digital trimming */

#define BITM_RTC_CR0_ALMINTEN                (_ADI_MSK_3(0x00000004,0x00000004U, uint16_t  ))    /*  Enable sourced alarm interrupts to the CPU */

#define BITM_RTC_CR0_ALMEN                   (_ADI_MSK_3(0x00000002,0x00000002U, uint16_t  ))    /*  Enable the RTC alarm (absolute) operation */

#define BITM_RTC_CR0_CNTEN                   (_ADI_MSK_3(0x00000001,0x00000001U, uint16_t  ))    /*  Global enable for the RTC */
#define ENUM_RTC_CR0_EX_30_TIME_UNITS        (_ADI_MSK_3(0x000003C0,0x000003C0U, uint16_t  ))    /*  MOD60ALM: Example of setting a modulo-60 periodic interrupt from the RTC to be issued to the CPU at 30 time units past a modulo-60 boundary. */
#define ENUM_RTC_CR0_EX_55_TIME_UNITS        (_ADI_MSK_3(0x000006E0,0x000006E0U, uint16_t  ))    /*  MOD60ALM: Example of setting a modulo-60 periodic interrupt from the RTC to be issued to the CPU at 55 time units past a modulo-60 boundary. */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_SR0                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_SR0_ISOENB                  14            /*  Visibility status of 32 kHz sourced registers, taking account of power-domain isolation */
#define BITP_RTC_SR0_WSYNCTRM                13            /*  Synchronization status of posted writes to RTC Trim Register */
#define BITP_RTC_SR0_WSYNCALM1               12            /*  Synchronization status of posted writes to RTC Alarm 1 Register */
#define BITP_RTC_SR0_WSYNCALM0               11            /*  Synchronization status of posted writes to RTC Alarm 0 Register */
#define BITP_RTC_SR0_WSYNCCNT1               10            /*  Synchronization status of posted writes to RTC Count 1 Register */
#define BITP_RTC_SR0_WSYNCCNT0                9            /*  Synchronization status of posted writes to RTC Count 0 Register */
#define BITP_RTC_SR0_WSYNCSR0                 8            /*  Synchronization status of posted clearances to interrupt sources in RTC Status 0 Register */
#define BITP_RTC_SR0_WSYNCCR0                 7            /*  Synchronization status of posted writes to RTC Control 0 Register */
#define BITP_RTC_SR0_WPNDINT                  6            /*  Write pending interrupt */
#define BITP_RTC_SR0_WSYNCINT                 5            /*  Write synchronization interrupt */
#define BITP_RTC_SR0_WPNDERRINT               4            /*  Write pending error interrupt source */
#define BITP_RTC_SR0_ISOINT                   3            /*  RTC power-domain isolation interrupt source */
#define BITP_RTC_SR0_MOD60ALMINT              2            /*  Modulo-60 RTC alarm interrupt source */
#define BITP_RTC_SR0_ALMINT                   1            /*  Alarm interrupt source */

#define BITM_RTC_SR0_ISOENB                  (_ADI_MSK_3(0x00004000,0x00004000U, uint16_t  ))    /*  Visibility status of 32 kHz sourced registers, taking account of power-domain isolation */

#define BITM_RTC_SR0_WSYNCTRM                (_ADI_MSK_3(0x00002000,0x00002000U, uint16_t  ))    /*  Synchronization status of posted writes to RTC Trim Register */

#define BITM_RTC_SR0_WSYNCALM1               (_ADI_MSK_3(0x00001000,0x00001000U, uint16_t  ))    /*  Synchronization status of posted writes to RTC Alarm 1 Register */

#define BITM_RTC_SR0_WSYNCALM0               (_ADI_MSK_3(0x00000800,0x00000800U, uint16_t  ))    /*  Synchronization status of posted writes to RTC Alarm 0 Register */

