ARMmbed/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM302X/TARGET_ADUCM3029/device/sys/ADuCM302x.h
#define BITM_RTC_TRM_IVL                     (_ADI_MSK_3(0x00000030,0x00000030U, uint16_t  ))    /*  Trim interval in prescaled RTC time units */

#define BITM_RTC_TRM_ADD                     (_ADI_MSK_3(0x00000008,0x00000008U, uint16_t  ))    /*  Trim Polarity */

#define BITM_RTC_TRM_VALUE                   (_ADI_MSK_3(0x00000007,0x00000007U, uint16_t  ))    /*  Trim value in prescaled RTC time units to be added or subtracted from the RTC count at the end of a periodic interval selected by RTC Trim Register */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_GWY                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_GWY_SWKEY                    0            /*  Software-keyed command issued by the CPU */
#define BITM_RTC_GWY_SWKEY                   (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  Software-keyed command issued by the CPU */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_CR1                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_CR1_PRESCALE2EXP             5            /*  Prescale power of 2 division factor for the RTC base clock */
#define BITP_RTC_CR1_CNTMOD60ROLLINTEN        4            /*  Enable for the RTC modulo-60 count roll-over interrupt source in RTC Status 2 Register */
#define BITP_RTC_CR1_CNTROLLINTEN             3            /*  Enable for the RTC count roll-over interrupt source in RTC Status 2 Register */
#define BITP_RTC_CR1_RTCTRMINTEN              2            /*  Enable for the RTC Trim interrupt source */
#define BITP_RTC_CR1_PSINTEN                  1            /*  Enable for the prescaled, modulo-1 interrupt source */
#define BITP_RTC_CR1_CNTINTEN                 0            /*  Enable for the RTC count interrupt source */

#define BITM_RTC_CR1_PRESCALE2EXP            (_ADI_MSK_3(0x000001E0,0x000001E0U, uint16_t  ))    /*  Prescale power of 2 division factor for the RTC base clock */

#define BITM_RTC_CR1_CNTMOD60ROLLINTEN       (_ADI_MSK_3(0x00000010,0x00000010U, uint16_t  ))    /*  Enable for the RTC modulo-60 count roll-over interrupt source in RTC Status 2 Register */

#define BITM_RTC_CR1_CNTROLLINTEN            (_ADI_MSK_3(0x00000008,0x00000008U, uint16_t  ))    /*  Enable for the RTC count roll-over interrupt source in RTC Status 2 Register */

#define BITM_RTC_CR1_RTCTRMINTEN             (_ADI_MSK_3(0x00000004,0x00000004U, uint16_t  ))    /*  Enable for the RTC Trim interrupt source */

#define BITM_RTC_CR1_PSINTEN                 (_ADI_MSK_3(0x00000002,0x00000002U, uint16_t  ))    /*  Enable for the prescaled, modulo-1 interrupt source */

#define BITM_RTC_CR1_CNTINTEN                (_ADI_MSK_3(0x00000001,0x00000001U, uint16_t  ))    /*  Enable for the RTC count interrupt source */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_SR2                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_SR2_WSYNCALM2MIR            15            /*  Synchronization status of posted writes to RTC Alarm 2 Register */
#define BITP_RTC_SR2_WSYNCCR1MIR             14            /*  Synchronization status of posted writes to RTC Control 1 Register */
#define BITP_RTC_SR2_WPNDALM2MIR             13            /*  Pending status of posted writes to RTC Alarm 2 Register */
#define BITP_RTC_SR2_WPNDCR1MIR              12            /*  Pending status of posted writes to RTC Control 1 Register */
#define BITP_RTC_SR2_TRMBDYMIR                7            /*  Mirror of the RTCTRMBDY field of RTC Modulo Register */
#define BITP_RTC_SR2_CNTMOD60ROLL             6            /*  RTC count modulo-60 roll-over */
#define BITP_RTC_SR2_CNTROLL                  5            /*  RTC count roll-over */
#define BITP_RTC_SR2_CNTMOD60ROLLINT          4            /*  RTC modulo-60 count roll-over interrupt source */
#define BITP_RTC_SR2_CNTROLLINT               3            /*  RTC count roll-over interrupt source */
#define BITP_RTC_SR2_TRMINT                   2            /*  RTC Trim interrupt source */
#define BITP_RTC_SR2_PSINT                    1            /*  RTC prescaled, modulo-1 boundary interrupt source */
#define BITP_RTC_SR2_CNTINT                   0            /*  RTC count interrupt source */

#define BITM_RTC_SR2_WSYNCALM2MIR            (_ADI_MSK_3(0x00008000,0x00008000U, uint16_t  ))    /*  Synchronization status of posted writes to RTC Alarm 2 Register */

#define BITM_RTC_SR2_WSYNCCR1MIR             (_ADI_MSK_3(0x00004000,0x00004000U, uint16_t  ))    /*  Synchronization status of posted writes to RTC Control 1 Register */

#define BITM_RTC_SR2_WPNDALM2MIR             (_ADI_MSK_3(0x00002000,0x00002000U, uint16_t  ))    /*  Pending status of posted writes to RTC Alarm 2 Register */

#define BITM_RTC_SR2_WPNDCR1MIR              (_ADI_MSK_3(0x00001000,0x00001000U, uint16_t  ))    /*  Pending status of posted writes to RTC Control 1 Register */
#define BITM_RTC_SR2_TRMBDYMIR               (_ADI_MSK_3(0x00000080,0x00000080U, uint16_t  ))    /*  Mirror of the RTCTRMBDY field of RTC Modulo Register */

#define BITM_RTC_SR2_CNTMOD60ROLL            (_ADI_MSK_3(0x00000040,0x00000040U, uint16_t  ))    /*  RTC count modulo-60 roll-over */

#define BITM_RTC_SR2_CNTROLL                 (_ADI_MSK_3(0x00000020,0x00000020U, uint16_t  ))    /*  RTC count roll-over */

#define BITM_RTC_SR2_CNTMOD60ROLLINT         (_ADI_MSK_3(0x00000010,0x00000010U, uint16_t  ))    /*  RTC modulo-60 count roll-over interrupt source */

