ARMmbed/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM302X/TARGET_ADUCM3029/device/sys/ADuCM302x.h
#define BITM_RTC_SR3_RTCOC1IRQ               (_ADI_MSK_3(0x00000200,0x00000200U, uint16_t  ))    /*  Sticky Interrupt Source for Output Compare Channel 1 */

#define BITM_RTC_SR3_ALMINTMIR               (_ADI_MSK_3(0x00000100,0x00000100U, uint16_t  ))    /*  Read-only mirror of the ALMINT interrupt source in RTC Status 0 Register, acting as RTCOC0IRQ */

#define BITM_RTC_SR3_RTCIC4IRQ               (_ADI_MSK_3(0x00000010,0x00000010U, uint16_t  ))    /*  Sticky Interrupt Source for the RTC Input Capture Channel 4 */

#define BITM_RTC_SR3_RTCIC3IRQ               (_ADI_MSK_3(0x00000008,0x00000008U, uint16_t  ))    /*  Sticky Interrupt Source for the RTC Input Capture Channel 3 */

#define BITM_RTC_SR3_RTCIC2IRQ               (_ADI_MSK_3(0x00000004,0x00000004U, uint16_t  ))    /*  Sticky Interrupt Source for the RTC Input Capture Channel 2 */

#define BITM_RTC_SR3_RTCIC0IRQ               (_ADI_MSK_3(0x00000001,0x00000001U, uint16_t  ))    /*  Sticky Interrupt Source for the RTC Input Capture Channel 0 */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_CR2IC                            Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_CR2IC_RTCICOWUSEN           15            /*  Enable Overwrite of Unread Snapshots for all RTC Input Capture Channels */
#define BITP_RTC_CR2IC_RTCIC4IRQEN           14            /*  Interrupt Enable for the RTC Input Capture Channel 4 */
#define BITP_RTC_CR2IC_RTCIC3IRQEN           13            /*  Interrupt Enable for the RTC Input Capture Channel 3 */
#define BITP_RTC_CR2IC_RTCIC2IRQEN           12            /*  Interrupt Enable for the RTC Input Capture Channel 2 */
#define BITP_RTC_CR2IC_RTCIC0IRQEN           10            /*  Interrupt Enable for the RTC Input Capture Channel 0 */
#define BITP_RTC_CR2IC_RTCIC4LH               9            /*  Polarity of the active-going capture edge for the RTC Input Capture Channel 4 */
#define BITP_RTC_CR2IC_RTCIC3LH               8            /*  Polarity of the active-going capture edge for the RTC Input Capture Channel 3 */
#define BITP_RTC_CR2IC_RTCIC2LH               7            /*  Polarity of the active-going capture edge for the RTC Input Capture Channel 2 */
#define BITP_RTC_CR2IC_RTCIC0LH               5            /*  Polarity of the active-going capture edge for the RTC Input Capture Channel 0 */
#define BITP_RTC_CR2IC_RTCIC4EN               4            /*  Enable for the RTC Input Capture Channel 4 */
#define BITP_RTC_CR2IC_RTCIC3EN               3            /*  Enable for the RTC Input Capture Channel 3 */
#define BITP_RTC_CR2IC_RTCIC2EN               2            /*  Enable for the RTC Input Capture Channel 2 */
#define BITP_RTC_CR2IC_RTCIC0EN               0            /*  Enable for the RTC Input Capture Channel 0 */

#define BITM_RTC_CR2IC_RTCICOWUSEN           (_ADI_MSK_3(0x00008000,0x00008000U, uint16_t  ))    /*  Enable Overwrite of Unread Snapshots for all RTC Input Capture Channels */

#define BITM_RTC_CR2IC_RTCIC4IRQEN           (_ADI_MSK_3(0x00004000,0x00004000U, uint16_t  ))    /*  Interrupt Enable for the RTC Input Capture Channel 4 */

#define BITM_RTC_CR2IC_RTCIC3IRQEN           (_ADI_MSK_3(0x00002000,0x00002000U, uint16_t  ))    /*  Interrupt Enable for the RTC Input Capture Channel 3 */

#define BITM_RTC_CR2IC_RTCIC2IRQEN           (_ADI_MSK_3(0x00001000,0x00001000U, uint16_t  ))    /*  Interrupt Enable for the RTC Input Capture Channel 2 */

#define BITM_RTC_CR2IC_RTCIC0IRQEN           (_ADI_MSK_3(0x00000400,0x00000400U, uint16_t  ))    /*  Interrupt Enable for the RTC Input Capture Channel 0 */

#define BITM_RTC_CR2IC_RTCIC4LH              (_ADI_MSK_3(0x00000200,0x00000200U, uint16_t  ))    /*  Polarity of the active-going capture edge for the RTC Input Capture Channel 4 */

#define BITM_RTC_CR2IC_RTCIC3LH              (_ADI_MSK_3(0x00000100,0x00000100U, uint16_t  ))    /*  Polarity of the active-going capture edge for the RTC Input Capture Channel 3 */

#define BITM_RTC_CR2IC_RTCIC2LH              (_ADI_MSK_3(0x00000080,0x00000080U, uint16_t  ))    /*  Polarity of the active-going capture edge for the RTC Input Capture Channel 2 */

#define BITM_RTC_CR2IC_RTCIC0LH              (_ADI_MSK_3(0x00000020,0x00000020U, uint16_t  ))    /*  Polarity of the active-going capture edge for the RTC Input Capture Channel 0 */

#define BITM_RTC_CR2IC_RTCIC4EN              (_ADI_MSK_3(0x00000010,0x00000010U, uint16_t  ))    /*  Enable for the RTC Input Capture Channel 4 */

#define BITM_RTC_CR2IC_RTCIC3EN              (_ADI_MSK_3(0x00000008,0x00000008U, uint16_t  ))    /*  Enable for the RTC Input Capture Channel 3 */

#define BITM_RTC_CR2IC_RTCIC2EN              (_ADI_MSK_3(0x00000004,0x00000004U, uint16_t  ))    /*  Enable for the RTC Input Capture Channel 2 */

#define BITM_RTC_CR2IC_RTCIC0EN              (_ADI_MSK_3(0x00000001,0x00000001U, uint16_t  ))    /*  Enable for the RTC Input Capture Channel 0 */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_CR3OC                            Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_CR3OC_RTCOC1IRQEN            9            /*  Interrupt Enable for Output Compare Channel 1 */
#define BITP_RTC_CR3OC_RTCOC1EN               1            /*  Enable for Output Compare Channel 1 */

#define BITM_RTC_CR3OC_RTCOC1IRQEN           (_ADI_MSK_3(0x00000200,0x00000200U, uint16_t  ))    /*  Interrupt Enable for Output Compare Channel 1 */

#define BITM_RTC_CR3OC_RTCOC1EN              (_ADI_MSK_3(0x00000002,0x00000002U, uint16_t  ))    /*  Enable for Output Compare Channel 1 */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_CR4OC                            Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_CR4OC_RTCOC1ARLEN            9            /*  Enable for auto-reloading when output compare match occurs */
#define BITP_RTC_CR4OC_RTCOC1MSKEN            1            /*  Enable for thermometer-code masking of the Output Compare 1 Channel */

#define BITM_RTC_CR4OC_RTCOC1ARLEN           (_ADI_MSK_3(0x00000200,0x00000200U, uint16_t  ))    /*  Enable for auto-reloading when output compare match occurs */

#define BITM_RTC_CR4OC_RTCOC1MSKEN           (_ADI_MSK_3(0x00000002,0x00000002U, uint16_t  ))    /*  Enable for thermometer-code masking of the Output Compare 1 Channel */
#define ENUM_RTC_CR4OC_EN000                 (_ADI_MSK_3(0x00000000,0x00000000U, uint16_t  ))    /*  RTCOC1MSKEN: Do not apply a mask to the 16-bit Output Compare channel ${.:OC1}. */
#define ENUM_RTC_CR4OC_EN001                 (_ADI_MSK_3(0x00000002,0x00000002U, uint16_t  ))    /*  RTCOC1MSKEN: Apply a thermometer-decoded mask to the 16-bit Output Compare channel ${.:OC1} provided that channel is enabled via ${.:CR3OC:RTCOC1EN} */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_OCMSK                            Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_OCMSK_RTCOCMSK               0            /*  Concatenation of thermometer-encoded masks for the output compare channel */
#define BITM_RTC_OCMSK_RTCOCMSK              (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  Concatenation of thermometer-encoded masks for the output compare channel */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_OC1ARL                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_OC1ARL_RTCOC1ARL             0            /*  Auto-reload value when output compare match occurs */
#define BITM_RTC_OC1ARL_RTCOC1ARL            (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  Auto-reload value when output compare match occurs */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_IC2                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_IC2_RTCIC2                   0            /*  RTC Input Capture Channel 2 */
#define BITM_RTC_IC2_RTCIC2                  (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  RTC Input Capture Channel 2 */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_IC3                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_IC3_RTCIC3                   0            /*  RTC Input Capture Channel 3 */
#define BITM_RTC_IC3_RTCIC3                  (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  RTC Input Capture Channel 3 */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_IC4                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_IC4_RTCIC4                   0            /*  RTC Input Capture Channel 4 */
#define BITM_RTC_IC4_RTCIC4                  (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  RTC Input Capture Channel 4 */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_OC1                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_OC1_RTCOC1                   0            /*  RTC Output Compare 1 Channel */
#define BITM_RTC_OC1_RTCOC1                  (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  RTC Output Compare 1 Channel */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_SR4                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_SR4_RSYNCIC4                14            /*  Synchronization status of posted reads of RTC Input Channel 4 */
#define BITP_RTC_SR4_RSYNCIC3                13            /*  Synchronization status of posted reads of RTC Input Channel 3 */
#define BITP_RTC_SR4_RSYNCIC2                12            /*  Synchronization status of posted reads of RTC Input Channel 2 */
#define BITP_RTC_SR4_RSYNCIC0                10            /*  Synchronization status of posted reads of RTC Input Channel 0 */
#define BITP_RTC_SR4_WSYNCOC1                 6            /*  Synchronization status of posted writes to RTC Output Compare Channel 1 Register */
#define BITP_RTC_SR4_WSYNCOC1ARL              5            /*  Synchronization status of posted writes to RTC Auto-Reload for Output Compare Channel 1 Register */
#define BITP_RTC_SR4_WSYNCOCMSK               4            /*  Synchronization status of posted writes to RTC Masks for Output Compare Channel Register */
#define BITP_RTC_SR4_WSYNCCR4OC               3            /*  Synchronization status of posted writes to RTC Control 4 for Configuring Output Compare Channel Register */
#define BITP_RTC_SR4_WSYNCCR3OC               2            /*  Synchronization status of posted writes to RTC Control 3 for Configuring Output Compare Channel Register */
#define BITP_RTC_SR4_WSYNCCR2IC               1            /*  Synchronization status of posted writes to RTC Control 2 for Configuring Input Capture Channels Register */
#define BITP_RTC_SR4_WSYNCSR3                 0            /*  Synchronization status of posted clearances to interrupt sources in RTC Status 3 Register */

