ARMmbed/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM302X/TARGET_ADUCM3029/device/sys/ADuCM302x.h
#define BITM_RTC_SR4_RSYNCIC4                (_ADI_MSK_3(0x00004000,0x00004000U, uint16_t  ))    /*  Synchronization status of posted reads of RTC Input Channel 4 */

#define BITM_RTC_SR4_RSYNCIC3                (_ADI_MSK_3(0x00002000,0x00002000U, uint16_t  ))    /*  Synchronization status of posted reads of RTC Input Channel 3 */

#define BITM_RTC_SR4_RSYNCIC2                (_ADI_MSK_3(0x00001000,0x00001000U, uint16_t  ))    /*  Synchronization status of posted reads of RTC Input Channel 2 */

#define BITM_RTC_SR4_RSYNCIC0                (_ADI_MSK_3(0x00000400,0x00000400U, uint16_t  ))    /*  Synchronization status of posted reads of RTC Input Channel 0 */

#define BITM_RTC_SR4_WSYNCOC1                (_ADI_MSK_3(0x00000040,0x00000040U, uint16_t  ))    /*  Synchronization status of posted writes to RTC Output Compare Channel 1 Register */

#define BITM_RTC_SR4_WSYNCOC1ARL             (_ADI_MSK_3(0x00000020,0x00000020U, uint16_t  ))    /*  Synchronization status of posted writes to RTC Auto-Reload for Output Compare Channel 1 Register */

#define BITM_RTC_SR4_WSYNCOCMSK              (_ADI_MSK_3(0x00000010,0x00000010U, uint16_t  ))    /*  Synchronization status of posted writes to RTC Masks for Output Compare Channel Register */

#define BITM_RTC_SR4_WSYNCCR4OC              (_ADI_MSK_3(0x00000008,0x00000008U, uint16_t  ))    /*  Synchronization status of posted writes to RTC Control 4 for Configuring Output Compare Channel Register */

#define BITM_RTC_SR4_WSYNCCR3OC              (_ADI_MSK_3(0x00000004,0x00000004U, uint16_t  ))    /*  Synchronization status of posted writes to RTC Control 3 for Configuring Output Compare Channel Register */

#define BITM_RTC_SR4_WSYNCCR2IC              (_ADI_MSK_3(0x00000002,0x00000002U, uint16_t  ))    /*  Synchronization status of posted writes to RTC Control 2 for Configuring Input Capture Channels Register */

#define BITM_RTC_SR4_WSYNCSR3                (_ADI_MSK_3(0x00000001,0x00000001U, uint16_t  ))    /*  Synchronization status of posted clearances to interrupt sources in RTC Status 3 Register */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_SR5                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_SR5_RPENDIC4                14            /*  Pending status of posted reads of RTC Input Channel 4 */
#define BITP_RTC_SR5_RPENDIC3                13            /*  Pending status of posted reads of RTC Input Channel 3 */
#define BITP_RTC_SR5_RPENDIC2                12            /*  Pending status of posted reads of RTC Input Channel 2 */
#define BITP_RTC_SR5_RPENDIC0                10            /*  Pending status of posted reads of RTC Input Channel 0 */
#define BITP_RTC_SR5_WPENDOC1                 6            /*  Pending status of posted writes to Output Compare Channel 1 */
#define BITP_RTC_SR5_WPENDOC1ARL              5            /*  Pending status of posted writes to RTC Auto-Reload for Output Compare Channel 1 Register */
#define BITP_RTC_SR5_WPENDOCMSK               4            /*  Pending status of posted writes to RTC Masks for Output Compare Channel Register */
#define BITP_RTC_SR5_WPENDCR4OC               3            /*  Pending status of posted writes to RTC Control 4 for Configuring Output Compare Channel Register */
#define BITP_RTC_SR5_WPENDCR3OC               2            /*  Pending status of posted writes to RTC Control 3 for Configuring Output Compare Channel Register */
#define BITP_RTC_SR5_WPENDCR2IC               1            /*  Pending status of posted writes to RTC Control 2 for Configuring Input Capture Channels Register */
#define BITP_RTC_SR5_WPENDSR3                 0            /*  Pending status of posted clearances of interrupt sources in RTC Status 3 Register */

#define BITM_RTC_SR5_RPENDIC4                (_ADI_MSK_3(0x00004000,0x00004000U, uint16_t  ))    /*  Pending status of posted reads of RTC Input Channel 4 */

#define BITM_RTC_SR5_RPENDIC3                (_ADI_MSK_3(0x00002000,0x00002000U, uint16_t  ))    /*  Pending status of posted reads of RTC Input Channel 3 */

#define BITM_RTC_SR5_RPENDIC2                (_ADI_MSK_3(0x00001000,0x00001000U, uint16_t  ))    /*  Pending status of posted reads of RTC Input Channel 2 */

#define BITM_RTC_SR5_RPENDIC0                (_ADI_MSK_3(0x00000400,0x00000400U, uint16_t  ))    /*  Pending status of posted reads of RTC Input Channel 0 */

#define BITM_RTC_SR5_WPENDOC1                (_ADI_MSK_3(0x00000040,0x00000040U, uint16_t  ))    /*  Pending status of posted writes to Output Compare Channel 1 */

#define BITM_RTC_SR5_WPENDOC1ARL             (_ADI_MSK_3(0x00000020,0x00000020U, uint16_t  ))    /*  Pending status of posted writes to RTC Auto-Reload for Output Compare Channel 1 Register */

#define BITM_RTC_SR5_WPENDOCMSK              (_ADI_MSK_3(0x00000010,0x00000010U, uint16_t  ))    /*  Pending status of posted writes to RTC Masks for Output Compare Channel Register */

#define BITM_RTC_SR5_WPENDCR4OC              (_ADI_MSK_3(0x00000008,0x00000008U, uint16_t  ))    /*  Pending status of posted writes to RTC Control 4 for Configuring Output Compare Channel Register */

#define BITM_RTC_SR5_WPENDCR3OC              (_ADI_MSK_3(0x00000004,0x00000004U, uint16_t  ))    /*  Pending status of posted writes to RTC Control 3 for Configuring Output Compare Channel Register */

#define BITM_RTC_SR5_WPENDCR2IC              (_ADI_MSK_3(0x00000002,0x00000002U, uint16_t  ))    /*  Pending status of posted writes to RTC Control 2 for Configuring Input Capture Channels Register */

#define BITM_RTC_SR5_WPENDSR3                (_ADI_MSK_3(0x00000001,0x00000001U, uint16_t  ))    /*  Pending status of posted clearances of interrupt sources in RTC Status 3 Register */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_SR6                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_SR6_RTCFRZCNTPTR             9            /*  Pointer for the triple-read sequence of the RTC Freeze Count MMR */
#define BITP_RTC_SR6_RTCIC0SNAP               8            /*  Confirmation that RTC Snapshot 0, 1, 2 registers reflect the value of RTC Input Capture Channel 0 */
#define BITP_RTC_SR6_RTCIC4UNR                4            /*  Sticky unread status of the RTC Input Capture Channel 4 */
#define BITP_RTC_SR6_RTCIC3UNR                3            /*  Sticky unread status of the RTC Input Capture Channel 3 */
#define BITP_RTC_SR6_RTCIC2UNR                2            /*  Sticky unread status of the RTC Input Capture Channel 2 */
#define BITP_RTC_SR6_RTCIC0UNR                0            /*  Sticky unread status of the RTC Input Capture Channel 0 */

