ARMmbed/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM302X/TARGET_ADUCM3029/device/sys/ADuCM302x.h
#define BITM_RTC_SR6_RTCFRZCNTPTR            (_ADI_MSK_3(0x00000600,0x00000600U, uint16_t  ))    /*  Pointer for the triple-read sequence of the RTC Freeze Count MMR */

#define BITM_RTC_SR6_RTCIC0SNAP              (_ADI_MSK_3(0x00000100,0x00000100U, uint16_t  ))    /*  Confirmation that RTC Snapshot 0, 1, 2 registers reflect the value of RTC Input Capture Channel 0 */

#define BITM_RTC_SR6_RTCIC4UNR               (_ADI_MSK_3(0x00000010,0x00000010U, uint16_t  ))    /*  Sticky unread status of the RTC Input Capture Channel 4 */

#define BITM_RTC_SR6_RTCIC3UNR               (_ADI_MSK_3(0x00000008,0x00000008U, uint16_t  ))    /*  Sticky unread status of the RTC Input Capture Channel 3 */

#define BITM_RTC_SR6_RTCIC2UNR               (_ADI_MSK_3(0x00000004,0x00000004U, uint16_t  ))    /*  Sticky unread status of the RTC Input Capture Channel 2 */

#define BITM_RTC_SR6_RTCIC0UNR               (_ADI_MSK_3(0x00000001,0x00000001U, uint16_t  ))    /*  Sticky unread status of the RTC Input Capture Channel 0 */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_OC1TGT                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_OC1TGT_RTCOC1TGT             0            /*  Provides visibility to the CPU of the current target value for the output-compare channel 1, taking account of any possible auto-reloading */
#define BITM_RTC_OC1TGT_RTCOC1TGT            (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  Provides visibility to the CPU of the current target value for the output-compare channel 1, taking account of any possible auto-reloading */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_FRZCNT                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_FRZCNT_RTCFRZCNT             0            /*  RTC Freeze Count. Coherent, triple 16-bit read of the 47-bit RTC count */
#define BITM_RTC_FRZCNT_RTCFRZCNT            (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  RTC Freeze Count. Coherent, triple 16-bit read of the 47-bit RTC count */


/* ============================================================================================================================
        System Identification and Debug Enable
   ============================================================================================================================ */

/* ============================================================================================================================
        SYS
   ============================================================================================================================ */
#define REG_SYS_ADIID                        0x40002020            /*  SYS ADI Identification */
#define REG_SYS_CHIPID                       0x40002024            /*  SYS Chip Identifier */
#define REG_SYS_SWDEN                        0x40002040            /*  SYS Serial Wire Debug Enable */

/* ============================================================================================================================
        SYS Register BitMasks, Positions & Enumerations 
   ============================================================================================================================ */
/* -------------------------------------------------------------------------------------------------------------------------
          SYS_ADIID                            Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SYS_ADIID_VALUE                  0            /*  Reads a fixed value of 0x4144 to indicate to debuggers that they are connected to an Analog Devices implemented Cortex based part */
#define BITM_SYS_ADIID_VALUE                 (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  Reads a fixed value of 0x4144 to indicate to debuggers that they are connected to an Analog Devices implemented Cortex based part */

/* -------------------------------------------------------------------------------------------------------------------------
          SYS_CHIPID                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SYS_CHIPID_PARTID                4            /*  Part identifier */
#define BITP_SYS_CHIPID_REV                   0            /*  Silicon revision */
#define BITM_SYS_CHIPID_PARTID               (_ADI_MSK_3(0x0000FFF0,0x0000FFF0U, uint16_t  ))    /*  Part identifier */
#define BITM_SYS_CHIPID_REV                  (_ADI_MSK_3(0x0000000F,0x0000000FU, uint16_t  ))    /*  Silicon revision */

/* -------------------------------------------------------------------------------------------------------------------------
          SYS_SWDEN                            Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SYS_SWDEN_VALUE                  0            /*  To enable SWD interface */
#define BITM_SYS_SWDEN_VALUE                 (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  To enable SWD interface */


/* ============================================================================================================================
        Watchdog Timer
   ============================================================================================================================ */

/* ============================================================================================================================
        WDT0
   ============================================================================================================================ */
#define REG_WDT0_LOAD                        0x40002C00            /*  WDT0 Load Value */
#define REG_WDT0_CCNT                        0x40002C04            /*  WDT0 Current Count Value */
#define REG_WDT0_CTL                         0x40002C08            /*  WDT0 Control */
#define REG_WDT0_RESTART                     0x40002C0C            /*  WDT0 Clear Interrupt */
#define REG_WDT0_STAT                        0x40002C18            /*  WDT0 Status */

