ARMmbed/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM302X/TARGET_ADUCM3029/device/sys/ADuCM302x.h
/* ====================================================================================================
 *    Interrupt Definitions
 * ==================================================================================================== */
#define INTR_RESET                           (-15)		/* Cortex-M3 Reset */
#define INTR_NonMaskableInt                  (-14)		/* Cortex-M3 Non-maskable Interrupt */
#define INTR_HardFault                       (-13)		/* Cortex-M3 Hardware Fault */
#define INTR_MemoryManagement                (-12)		/* Cortex-M3 Memory Management Interrupt */
#define INTR_BusFault                        (-11)		/* Cortex-M3 Bus Fault */
#define INTR_UsageFault                      (-10)		/* Cortex-M3 Usage Fault */
#define INTR_SVCall                          ( -5)		/* Cortex-M3 SVCall Interrupt */
#define INTR_DebugMonitor                    ( -4)		/* Cortex-M3 Debug Monitor */
#define INTR_PendSV                          ( -2)		/* Cortex-M3 PendSV Interrupt */
#define INTR_SysTick                         ( -1)		/* Cortex-M3 SysTick Interrupt */
#define INTR_RTC1_EVT                          0		/* Event */
#define INTR_XINT_EVT0                         1		/* External Wakeup Interrupt n */
#define INTR_XINT_EVT1                         2		/* External Wakeup Interrupt n */
#define INTR_XINT_EVT2                         3		/* External Wakeup Interrupt n */
#define INTR_XINT_EVT3                         4		/* External Wakeup Interrupt n */
#define INTR_WDT_EXP                           5		/* Expiration */
#define INTR_PMG0_VREG_OVR                     6		/* Voltage Regulator (VREG) Overvoltage */
#define INTR_PMG0_BATT_RANGE                   7		/* Battery Voltage (VBAT) Out of Range */
#define INTR_RTC0_EVT                          8		/* Event */
#define INTR_SYS_GPIO_INTA                     9		/* GPIO Interrupt A */
#define INTR_SYS_GPIO_INTB                    10		/* GPIO Interrupt B */
#define INTR_TMR0_EVT                         11		/* Event */
#define INTR_TMR1_EVT                         12		/* Event */
#define INTR_FLCC_EVT                         13		/* Event */
#define INTR_UART_EVT                         14		/* Event */
#define INTR_SPI0_EVT                         15		/* Event */
#define INTR_SPI2_EVT                         16		/* Event */
#define INTR_I2C_SLV_EVT                      17		/* Slave Event */
#define INTR_I2C_MST_EVT                      18		/* Master Event */
#define INTR_DMA_CHAN_ERR                     19		/* Channel Error */
#define INTR_DMA0_CH0_DONE                    20		/* Channel 0 Done */
#define INTR_DMA0_CH1_DONE                    21		/* Channel 1 Done */
#define INTR_DMA0_CH2_DONE                    22		/* Channel 2 Done */
#define INTR_DMA0_CH3_DONE                    23		/* Channel 3 Done */
#define INTR_DMA0_CH4_DONE                    24		/* Channel 4 Done */
#define INTR_DMA0_CH5_DONE                    25		/* Channel 5 Done */
#define INTR_DMA0_CH6_DONE                    26		/* Channel 6 Done */
#define INTR_DMA0_CH7_DONE                    27		/* Channel 7 Done */
#define INTR_DMA0_CH8_DONE                    28		/* Channel 8 Done */
#define INTR_DMA0_CH9_DONE                    29		/* Channel 9 Done */
#define INTR_DMA0_CH10_DONE                   30		/* Channel 10 Done */
#define INTR_DMA0_CH11_DONE                   31		/* Channel 11 Done */
#define INTR_DMA0_CH12_DONE                   32		/* Channel 12 Done */
#define INTR_DMA0_CH13_DONE                   33		/* Channel 13 Done */
#define INTR_DMA0_CH14_DONE                   34		/* Channel 14 Done */
#define INTR_DMA0_CH15_DONE                   35		/* Channel 15 Done */
#define INTR_SPORT_A_EVT                      36		/* Channel A Event */
#define INTR_SPORT_B_EVT                      37		/* Channel B Event */
#define INTR_CRYPT_EVT                        38		/* Event */
#define INTR_DMA0_CH24_DONE                   39		/* Channel 24 Done */
#define INTR_TMR2_EVT                         40		/* Event */
#define INTR_CLKG_XTAL_OSC_EVT                41		/* Crystal Oscillator Event */
#define INTR_SPI1_EVT                         42		/* Event */
#define INTR_CLKG_PLL_EVT                     43		/* PLL Event */
#define INTR_RNG0_EVT                         44		/* Event */
#define INTR_BEEP_EVT                         45		/* Event */
#define INTR_ADC0_EVT                         46		/* Event */
#define INTR_DMA0_CH16_DONE                   56		/* Channel 16 Done */
#define INTR_DMA0_CH17_DONE                   57		/* Channel 17 Done */
#define INTR_DMA0_CH18_DONE                   58		/* Channel 18 Done */
#define INTR_DMA0_CH19_DONE                   59		/* Channel 19 Done */
#define INTR_DMA0_CH20_DONE                   60		/* Channel 20 Done */
#define INTR_DMA0_CH21_DONE                   61		/* Channel 21 Done */
#define INTR_DMA0_CH22_DONE                   62		/* Channel 22 Done */
#define INTR_DMA0_CH23_DONE                   63		/* Channel 23 Done */


#if defined (_MISRA_RULES)
#pragma diag(pop)
#endif /* _MISRA_RULES */

#endif	/* end ifndef _DEF_ADUCM302X_H */
